
import Foundation
import UIKit

struct Content {
    static let infoName = "Привычка за 21 день"
    static let infoFirstText =
    "Прохождение этапов, за которые за 21 день вырабатывается привычка, подчиняется следующему алгоритму: "
    static let infoSecondText =
    "1. Провести 1 день без обращения к старым привычкам, стараться вести себя так, как будто цель, загаданная в перспективу, находится на расстоянии шага. "
    static let infoThirdText =
    "2. Выдержать 2 дня в прежнем состоянии самоконтроля. "
    static let infoFourthText =
    "3. Отметить в дневнике первую неделю изменений и подвести первые итоги — что оказалось тяжело, что — легче, с чем еще предстоит серьезно бороться."
    static let infoFifthText =
    "4. Поздравить себя с прохождением первого серьезного порога в 21 день. За это время отказ от дурных наклонностей уже примет форму осознанного преодоления и человек сможет больше работать в сторону принятия положительных качеств."
    static let infoSixthText =
    "5. Держать планку 40 дней. Практикующий методику уже чувствует себя освободившимся от прошлого негатива и двигается в нужном направлении с хорошей динамикой. "
    static let infoSeventhText =
    "6. На 90-й день соблюдения техники все лишнее из «прошлой жизни» перестает напоминать о себе, и человек, оглянувшись назад, осознает себя полностью обновившимся."
    static let infoEighthText =
    "Источник: psychbook.ru "
}

struct Colors {
    static let purple = UIColor(red: 161 / 255, green: 22 / 255, blue: 204 / 255, alpha: 1)
    static let blue = UIColor(red: 41 / 255, green: 109 / 255, blue: 255 / 255, alpha: 1)
    static let orange = UIColor(red: 255 / 255, green: 159 / 255, blue: 79 / 255, alpha: 1)
}
